Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# AdvancedSetting.drawBottomLineForHorizontalTabBar
source: Draw bottom line for horizontal tabbar in Regular, Dark and Light theme?
de: Untere Linie für die horizontale Tableiste in den Designs „Regulär“, „Dunkel“ und „Hell“ zeichnen?
ja: レギュラー、ダーク、ライトの各テーマで、水平タブバーの下部に線を描画しますか?
pt_br: Desenhar linha inferior para a barra de abas horizontal nos temas Regular, Dark e Light?
ru: Рисовать нижнюю линию для горизонтальной панели вкладок в темах Regular, Dark и Light?
zh_hans: 在“普通”、“深色”和“浅色”主题下为水平标签栏绘制底线？

# AdvancedSetting.drawOutlineAroundCursor
source: Draw outline around underline and vertical bar cursors using background color.
de: Umrandung um Unterstrich- und vertikale Balken-Cursor mit der Hintergrundfarbe zeichnen.
ja: 背景色を使って、下線カーソルと縦棒カーソルの周囲に輪郭線を描画します。
pt_br: Desenhar contorno ao redor dos cursores de sublinhado e barra vertical usando a cor de plano de fundo.
ru: Рисовать обводку вокруг курсоров-подчёркивания и вертикальной черты цветом фона.
zh_hans: 使用背景颜色在下划线和竖条光标周围绘制轮廓。

# AdvancedSetting.dryRunEraseAllSettingsAndData
source: Dry-run “Erase All Settings and Data”. When enabled, the Erase All Settings and Data button logs what it would delete (via NSLog) instead of actually deleting anything, and does not quit. Intended for testing the feature.
de: Testlauf für „Alle Einstellungen und Daten löschen“. Wenn aktiviert, protokolliert die Schaltfläche „Alle Einstellungen und Daten löschen“ (per NSLog), was sie löschen würde, anstatt tatsächlich etwas zu löschen, und beendet die App nicht. Zum Testen der Funktion gedacht.
ja: 「すべての設定とデータを消去」のドライラン。 有効にすると、「すべての設定とデータを消去」ボタンは実際には何も削除せず、削除する予定の内容を (NSLog 経由で) ログに記録するだけで、終了もしません。この機能をテストするためのものです。
pt_br: Simular “Apagar todos os ajustes e dados”. Quando ativado, o botão Apagar todos os ajustes e dados registra o que apagaria (via NSLog) em vez de realmente apagar algo, e não encerra. Destinado a testar o recurso.
ru: Пробный запуск «Стереть все настройки и данные». При включении кнопка «Стереть все настройки и данные» записывает в журнал (через NSLog), что было бы удалено, вместо фактического удаления, и не завершает работу приложения. Предназначено для тестирования этой функции.
zh_hans: 模拟执行“清除所有设置和数据”操作。 启用后，该按钮会通过 NSLog 记录将要删除的内容，而不会实际执行任何删除操作，且不会退出程序。此功能用于测试。

# AdvancedSetting.dwcLineCache
source: Enable cache of double-width character locations? This should improve performance. It is always on in nightly builds. You must restart iTerm2 for this setting to take effect.
de: Zwischenspeicher für die Positionen doppelt breiter Zeichen aktivieren? Dies sollte die Leistung verbessern. In Nightly-Builds ist es immer aktiviert. Sie müssen iTerm2 neu starten, damit diese Einstellung wirksam wird.
ja: 全角文字の位置のキャッシュを有効にしますか? これによりパフォーマンスが向上するはずです。ナイトリービルドでは常にオンになっています。この設定を反映するには iTerm2 を再起動する必要があります。
pt_br: Ativar cache de localizações de caracteres de largura dupla? Isto deve melhorar o desempenho. Está sempre ativado em builds noturnos. Você deve reiniciar o iTerm2 para que este ajuste tenha efeito.
ru: Включить кэш расположений широких символов? Это должно повысить производительность. В ночных сборках всегда включено. Для вступления настройки в силу нужно перезапустить iTerm2.
zh_hans: 是否启用双宽字符位置的缓存？ 这应有助于提升性能。在夜间构建版本中该功能始终处于开启状态。要使此设置生效，必须重启 iTerm2。

# AdvancedSetting.dynamicProfilesNotificationLatency
source: Delay between detecting a change to dynamic profiles and acting on it. If a lot of changes happen to the DynamicProfiles folder a longer delay will help coalesce filesystem events to reduce CPU usage.
de: Verzögerung zwischen dem Erkennen einer Änderung an dynamischen Profilen und der Reaktion darauf. Wenn viele Änderungen im Ordner DynamicProfiles auftreten, hilft eine längere Verzögerung dabei, Dateisystemereignisse zusammenzufassen und so die CPU-Auslastung zu verringern.
ja: ダイナミックプロファイルへの変更を検出してから反映するまでの遅延。 DynamicProfiles フォルダに多くの変更が発生する場合、遅延を長くするとファイルシステムイベントがまとめられ、CPU 使用率を抑えられます。
pt_br: Atraso entre detectar uma alteração em perfis dinâmicos e agir sobre ela. Se muitas alterações acontecerem na pasta DynamicProfiles, um atraso maior ajudará a agrupar eventos do sistema de arquivos para reduzir o uso de CPU.
ru: Задержка между обнаружением изменения в динамических профилях и реакцией на него. Если в папке DynamicProfiles происходит много изменений, более долгая задержка поможет объединить события файловой системы для снижения нагрузки на процессор.
zh_hans: 检测动态配置文件发生变化并采取相应操作之间的延迟时间。 如果 DynamicProfiles 文件夹中发生大量更改，较长的延迟有助于合并文件系统事件，从而降低 CPU 使用率。

# AdvancedSetting.dynamicProfilesPath
source: Path to folder with dynamic profiles. When empty, ~/Library/Application Support/iTerm2/DynamicProfiles will be used. You must restart iTerm2 after modifying this setting.
de: Pfad zum Ordner mit dynamischen Profilen. Wenn leer, wird ~/Library/Application Support/iTerm2/DynamicProfiles verwendet. Sie müssen iTerm2 nach dem Ändern dieser Einstellung neu starten.
ja: ダイナミックプロファイルが格納されているフォルダへのパス。 空欄の場合、~/Library/Application Support/iTerm2/DynamicProfiles が使用されます。この設定を変更した後は iTerm2 を再起動する必要があります。
pt_br: Caminho para a pasta com perfis dinâmicos. Quando vazio, ~/Library/Application Support/iTerm2/DynamicProfiles será usado. Você deve reiniciar o iTerm2 após modificar este ajuste.
ru: Путь к папке с динамическими профилями. Если пусто, будет использована ~/Library/Application Support/iTerm2/DynamicProfiles. После изменения этой настройки нужно перезапустить iTerm2.
zh_hans: 动态配置文件所在文件夹的路径。 如果该路径为空，则会使用 ~/Library/Application Support/iTerm2/DynamicProfiles。修改此设置后必须重启 iTerm2。

# AdvancedSetting.echoProbeDuration
source: Amount of time to wait while testing if echo is on (seconds). This is used by the password manager to ensure you're at a password prompt. Set to 0 to disable echo probe.
de: Wartezeit beim Testen, ob Echo aktiviert ist (in Sekunden). Dies wird vom Passwort-Manager verwendet, um sicherzustellen, dass Sie sich an einer Passwortabfrage befinden. Auf 0 setzen, um die Echo-Prüfung zu deaktivieren.
ja: エコーが有効かどうかをテストする際に待機する時間 (秒単位)。 これは、パスワードマネージャーがパスワードプロンプトにいることを確認するために使用します。エコープローブを無効にするには 0 を指定してください。
pt_br: Tempo a aguardar ao testar se o eco está ativado (segundos). Isto é usado pelo cofre de senhas para garantir que você está em um prompt de senha. Defina como 0 para desativar a sondagem de eco.
ru: Время ожидания при проверке того, включено ли эхо (в секундах). Используется менеджером паролей, чтобы убедиться, что вы находитесь в запросе пароля. Установите 0, чтобы отключить проверку эха.
zh_hans: 检测是否开启回显功能时的等待时间（秒）。 密码管理器会使用此设置来确保用户处于密码输入界面。将其设置为 0 可禁用回显检测功能。

# AdvancedSetting.enableCharacterAccentMenu
source: Enable character accent menu. This disables the ordinary key repeat behavior for press-and-hold. You must restart iTerm2 for this change to take effect.
de: Zeichen-Akzentmenü aktivieren. Dies deaktiviert das übliche Verhalten der Tastenwiederholung beim Gedrückthalten. Sie müssen iTerm2 neu starten, damit diese Änderung wirksam wird.
ja: 文字のアクセントメニューを有効にします。 これにより、長押し時の通常のキーリピート動作が無効になります。この変更を反映するには iTerm2 を再起動する必要があります。
pt_br: Ativar o menu de acentos de caractere. Isto desativa o comportamento comum de repetição de tecla para pressionar e segurar. Você deve reiniciar o iTerm2 para que esta alteração tenha efeito.
ru: Включить меню акцентов символа. Это отключает обычное поведение повтора клавиши при удержании. Для вступления изменения в силу нужно перезапустить iTerm2.
zh_hans: 启用字符重音菜单。 此选项会禁用按住键时的普通重复输入功能。要使此更改生效，必须重启 iTerm2。

# AdvancedSetting.enableCmdClickPromptForShowCommandInfo
source: ⌘-click in the prompt shows the Command Info window
de: ⌘-Klick im Prompt zeigt das Fenster „Befehlsinfo“
ja: プロンプトで ⌘ クリックすると、コマンド情報ウィンドウを表示します
pt_br: ⌘-clique no prompt mostra a janela Command Info
ru: ⌘-щелчок в приглашении показывает окно сведений о команде
zh_hans: 在提示符处按住 ⌘ 再点击可显示命令信息窗口

# AdvancedSetting.enableContextualAlternates
source: Enable contextual alternates (calt) for ligature-capable fonts. When enabled, uses ligature level 2 which activates calt in addition to standard ligatures. Many coding fonts such as Monaspace, Iosevka, and Cascadia Code require this for their ligatures to work.
de: Kontextuelle Alternativen (calt) für ligaturfähige Schriftarten aktivieren. Wenn aktiviert, wird Ligaturstufe 2 verwendet, die calt zusätzlich zu den Standardligaturen aktiviert. Viele Programmierschriftarten wie Monaspace, Iosevka und Cascadia Code benötigen dies, damit ihre Ligaturen funktionieren.
ja: リガチャに対応したフォントで、文脈依存字形 (calt) を有効にします。 有効にすると、標準のリガチャに加えて calt を有効にするリガチャレベル 2 を使用します。Monaspace、Iosevka、Cascadia Code など多くのコーディング用フォントは、リガチャを機能させるためにこれが必要です。
pt_br: Ativar alternativas contextuais (calt) para fontes compatíveis com ligaduras. Quando ativado, usa o nível 2 de ligaduras, que ativa calt além das ligaduras padrão. Muitas fontes de programação como Monaspace, Iosevka e Cascadia Code exigem isto para que suas ligaduras funcionem.
ru: Включить контекстные альтернативы (calt) для шрифтов с поддержкой лигатур. При включении используется уровень лигатур 2, который активирует calt в дополнение к стандартным лигатурам. Многие шрифты для кода, такие как Monaspace, Iosevka и Cascadia Code, требуют этого для работы своих лигатур.
zh_hans: 为支持连字功能的字体启用上下文替代选项。 启用后，将使用二级连字功能，除了标准连字外还会激活上下文替代选项。许多编程字体，如 Monaspace、Iosevka 和 Cascadia Code，都需要此功能才能正常显示连字。

# AdvancedSetting.enableSecureKeyboardEntryAutomatically
source: Automatically enable secure keyboard entry at password prompts?
de: Sichere Tastatureingabe bei Passwortabfragen automatisch aktivieren?
ja: パスワードプロンプトで安全なキーボード入力を自動的に有効にしますか?
pt_br: Ativar automaticamente a entrada de teclado segura em prompts de senha?
ru: Автоматически включать безопасный ввод с клавиатуры в запросах пароля?
zh_hans: 在密码输入界面时自动启用安全键盘输入功能？

# AdvancedSetting.enableSemanticHistoryOnNetworkMounts
source: Enable semantic history for network-mounted filesystems? Only enable this if you know your network-mounted filesystems are really fast and reliable. A slow filesystem may cause the entire iTerm2 app to hang.
de: Semantic History für über das Netzwerk eingebundene Dateisysteme aktivieren? Aktivieren Sie dies nur, wenn Sie wissen, dass Ihre über das Netzwerk eingebundenen Dateisysteme wirklich schnell und zuverlässig sind. Ein langsames Dateisystem kann dazu führen, dass die gesamte iTerm2-App hängen bleibt.
ja: ネットワークマウントされたファイルシステムでセマンティック履歴を有効にしますか? ネットワークマウントされたファイルシステムが本当に高速で信頼できることが分かっている場合にのみ有効にしてください。ファイルシステムが遅いと、iTerm2 アプリ全体がハングすることがあります。
pt_br: Ativar o Semantic History para sistemas de arquivos montados via rede? Só ative isto se você souber que seus sistemas de arquivos montados via rede são realmente rápidos e confiáveis. Um sistema de arquivos lento pode fazer o app iTerm2 inteiro travar.
ru: Включить Semantic History для сетевых файловых систем? Включайте это, только если вы уверены, что ваши сетевые файловые системы действительно быстрые и надёжные. Медленная файловая система может привести к зависанию всего приложения iTerm2.
zh_hans: 为网络挂载的文件系统启用语义历史记录功能？ 仅当您确定网络挂载的文件系统速度极快且十分稳定时才启用此功能。速度较慢的文件系统可能会导致整个 iTerm2 应用程序卡住。

# AdvancedSetting.enableUnderlineSemanticHistoryOnCmdHover
source: Underline Semantic History-selectable items under the cursor while holding ⌘?
de: Mit Semantic History auswählbare Elemente unter dem Mauszeiger unterstreichen, während ⌘ gedrückt gehalten wird?
ja: ⌘ を押している間、カーソルの下にあるセマンティック履歴で選択可能な項目に下線を表示しますか?
pt_br: Sublinhar itens selecionáveis por Semantic History sob o cursor enquanto mantém ⌘?
ru: Подчёркивать элементы, доступные для Semantic History, под курсором при удержании ⌘?
zh_hans: 按住 ⌘ 时在光标下为语义历史记录中的可选项目添加下划线？

# AdvancedSetting.enableZoomMenu
source: Allow the standard system menu on window Zoom buttons to open? macOS has a bug that makes the app hang. Since this is a rarely used menu, it is disabled by default.
de: Das Öffnen des Standard-Systemmenüs bei den Zoom-Schaltflächen des Fensters erlauben? macOS hat einen Fehler, der die App hängen lässt. Da dieses Menü selten verwendet wird, ist es standardmäßig deaktiviert.
ja: ウィンドウの Zoom ボタンで標準のシステムメニューを開けるようにしますか? macOS にはアプリをハングさせるバグがあります。このメニューはめったに使われないため、デフォルトでは無効になっています。
pt_br: Permitir que o menu padrão do sistema nos botões de Zoom da janela abra? O macOS tem um bug que faz o app travar. Como este é um menu raramente usado, ele fica desativado por padrão.
ru: Разрешить открытие стандартного системного меню на кнопках Zoom окна? В macOS есть ошибка, вызывающая зависание приложения. Поскольку это редко используемое меню, оно отключено по умолчанию.
zh_hans: 允许使用窗口缩放按钮上的标准系统菜单？ macOS 存在一个会导致应用程序卡住的漏洞。由于该菜单很少被使用，因此默认处于禁用状态。

# AdvancedSetting.errorSound
source: When Alert on Next Mark is configured to play a sound, use a file with this name for erroneous completion of the previous command. You can name a system sound or a file in ~/Library/Sounds.
de: Wenn „Benachrichtigung bei nächster Marke“ so konfiguriert ist, dass ein Ton abgespielt wird, eine Datei mit diesem Namen für den fehlerhaften Abschluss des vorherigen Befehls verwenden. Sie können einen Systemton oder eine Datei in ~/Library/Sounds angeben.
ja: 「次のマークで通知」がサウンドを再生するよう設定されている場合、直前のコマンドがエラーで終了したときにこの名前のファイルを使用します。 システムサウンド名、または ~/Library/Sounds 内のファイル名を指定できます。
pt_br: Quando Alerta na próxima marca está configurado para tocar um som, usar um arquivo com este nome para a conclusão errônea do comando anterior. Você pode nomear um som do sistema ou um arquivo em ~/Library/Sounds.
ru: Когда «Оповещение при следующей метке» настроено на воспроизведение звука, использовать файл с этим именем для случаев ошибочного завершения предыдущей команды. Можно указать системный звук или файл в ~/Library/Sounds.
zh_hans: 当“在下一个标记处触发警告”被设置为播放声音时，可使用此命名的文件来处理上一个命令的错误完成情况。 您可以使用系统内置音效或位于~/Library/Sounds中的文件作为名称。

# AdvancedSetting.escapeWithQuotes
source: Escape file names with single quotes instead of backslashes. This is intended for users of xonsh, which does not accept backslash escaping.
de: Dateinamen mit einfachen Anführungszeichen statt mit Backslashes maskieren. Dies ist für Benutzer von xonsh gedacht, das kein Maskieren mit Backslash akzeptiert.
ja: ファイル名をバックスラッシュではなく単一引用符でエスケープします。 これは、バックスラッシュによるエスケープを受け付けない xonsh のユーザー向けです。
pt_br: Escapar nomes de arquivo com aspas simples em vez de barras invertidas. Isto é destinado a usuários do xonsh, que não aceita escape com barra invertida.
ru: Экранировать имена файлов одинарными кавычками вместо обратной косой черты. Предназначено для пользователей xonsh, который не принимает экранирование обратной косой чертой.
zh_hans: 请用单引号而非反斜杠来转义文件名。 这是为不支持反斜杠转义的xonsh用户设计的。

# AdvancedSetting.excludeBackgroundColorsFromCopiedStyle
source: Exclude all background colors when text is copied with color and font style? This includes both the default background color and non-default background colors.
de: Alle Hintergrundfarben ausschließen, wenn Text mit Farbe und Schriftstil kopiert wird? Dies umfasst sowohl die Standardhintergrundfarbe als auch abweichende Hintergrundfarben.
ja: 色とフォントスタイル付きでテキストをコピーする際、すべての背景色を除外しますか? これには、デフォルトの背景色とデフォルト以外の背景色の両方が含まれます。
pt_br: Excluir todas as cores de plano de fundo quando o texto é copiado com cor e estilo de fonte? Isto inclui tanto a cor de plano de fundo padrão quanto as cores de plano de fundo não padrão.
ru: Исключать все цвета фона при копировании текста с цветом и стилем шрифта? Это включает как цвет фона по умолчанию, так и нестандартные цвета фона.
zh_hans: 在复制带颜色和字体样式的文本时排除所有背景颜色？ 这包括默认背景颜色以及非默认背景颜色。

# AdvancedSetting.excludeUtunFromNetworkUtilization
source: Exclude utun interfaces from network utilization? This is useful if you use a VPN and only want to see the traffic that goes over Wi-Fi or Ethernet.
de: utun-Schnittstellen von der Netzwerkauslastung ausschließen? Dies ist nützlich, wenn Sie ein VPN verwenden und nur den Datenverkehr über WLAN oder Ethernet sehen möchten.
ja: ネットワーク使用率から utun インターフェースを除外しますか? VPN を使用していて、Wi-Fi または Ethernet 経由のトラフィックのみを確認したい場合に便利です。
pt_br: Excluir interfaces utun da utilização de rede? Isto é útil se você usa uma VPN e só quer ver o tráfego que passa por Wi-Fi ou Ethernet.
ru: Исключать интерфейсы utun из использования сети? Это полезно, если вы используете VPN и хотите видеть только трафик, идущий через Wi-Fi или Ethernet.
zh_hans: 在显示网络使用情况时排除utun接口？ 如果您使用了VPN，只想查看通过Wi-Fi或以太网传输的流量，此功能非常有用。

# AdvancedSetting.experimentalKeyHandling
source: Improved support for input method editors like AquaSKK.
de: Verbesserte Unterstützung für Eingabemethoden-Editoren wie AquaSKK.
ja: AquaSKK などのインプットメソッドエディタのサポートを改善します。
pt_br: Suporte melhorado para editores de método de entrada como o AquaSKK.
ru: Улучшенная поддержка редакторов методов ввода, таких как AquaSKK.
zh_hans: 对AquaSKK等输入法编辑器提供了更好的支持。

# AdvancedSetting.extendBackgroundColorIntoMargins
source: Extend background color into margins in alternate screen mode?
de: Hintergrundfarbe im alternativen Bildschirmmodus in die Ränder ausdehnen?
ja: 代替スクリーンモードで、背景色を余白まで拡張しますか?
pt_br: Estender a cor de plano de fundo para as margens no modo de tela alternada?
ru: Расширять цвет фона на поля в режиме альтернативного экрана?
zh_hans: 在备用屏幕模式下将背景颜色延伸至边缘？

# AdvancedSetting.extraSpaceBeforeCompactTopTabBar
source: Amount of extra space (in points) between stoplight buttons and inline tab bar. This only takes effect for the Compact and Minimal themes when the tab bar is visible and located at the top of the window.
de: Zusätzlicher Abstand (in Punkten) zwischen den Ampel-Schaltflächen und der eingebetteten Tableiste. Dies wirkt sich nur auf die Designs „Kompakt“ und „Minimal“ aus, wenn die Tableiste sichtbar ist und sich oben im Fenster befindet.
ja: 信号機ボタンとインラインタブバーの間に追加する余白の量 (ポイント単位)。 これは、タブバーが表示されていてウィンドウの上部にある場合の、コンパクトテーマとミニマルテーマにのみ適用されます。
pt_br: Quantidade de espaço extra (em pontos) entre os botões do semáforo e a barra de abas em linha. Isto só tem efeito para os temas Compact e Minimal quando a barra de abas está visível e localizada no topo da janela.
ru: Дополнительное расстояние (в пунктах) между кнопками управления окном и встроенной панелью вкладок. Это действует только для тем Compact и Minimal, когда панель вкладок видна и расположена в верхней части окна.
zh_hans: 信号灯按钮与内联标签栏之间的额外间距（以点为单位）。 仅当标签栏可见且位于窗口顶部时，此设置对紧凑主题和极简主题生效。

# AdvancedSetting.fakeFullyQualifiedDomainName
source: Override the local hostname used for localhost detection. When non-empty, the app behaves as though [NSHost fullyQualifiedDomainName] returns this value. Lets you test how localhost detection reacts to a hostname change without actually renaming your computer. Affects hosts reported after you change it; leave empty to use the real hostname.
de: Den lokalen Hostnamen überschreiben, der für die Localhost-Erkennung verwendet wird. Wenn nicht leer, verhält sich die App so, als würde [NSHost fullyQualifiedDomainName] diesen Wert zurückgeben. So können Sie testen, wie die Localhost-Erkennung auf eine Änderung des Hostnamens reagiert, ohne Ihren Computer tatsächlich umzubenennen. Wirkt sich auf Hosts aus, die nach der Änderung gemeldet werden; leer lassen, um den echten Hostnamen zu verwenden.
ja: localhost の検出に使用するローカルホスト名を上書きします。 空でない場合、アプリは [NSHost fullyQualifiedDomainName] がこの値を返すかのように動作します。実際にコンピューターの名前を変更することなく、ホスト名の変更に対して localhost の検出がどう反応するかをテストできます。変更後に報告されるホストに影響します。実際のホスト名を使用するには空欄のままにしてください。
pt_br: Substituir o nome de host local usado para detecção de localhost. Quando não vazio, o app se comporta como se [NSHost fullyQualifiedDomainName] retornasse este valor. Permite testar como a detecção de localhost reage a uma alteração de nome de host sem realmente renomear seu computador. Afeta hosts relatados depois que você o altera; deixe vazio para usar o nome de host real.
ru: Переопределить локальное имя хоста, используемое для определения localhost. Если не пусто, приложение ведёт себя так, будто [NSHost fullyQualifiedDomainName] возвращает это значение. Позволяет проверить, как определение localhost реагирует на смену имени хоста, не переименовывая при этом сам компьютер. Влияет на хосты, сообщаемые после изменения; оставьте пустым, чтобы использовать настоящее имя хоста.
zh_hans: 覆盖用于检测localhost的本地主机名。 若填写了该值，应用程序将表现得好像[NSHost fullyQualifiedDomainName]返回了这个值。这样无需实际重命名电脑，即可测试主机名变化对localhost检测的影响。更改后会影响后续报告的主机名；保持空白则使用真实主机名。

# AdvancedSetting.fakeNotchHeight
source: Simulated notch height
de: Simulierte Notch-Höhe
ja: シミュレートされたノッチの高さ
pt_br: Altura simulada do notch
ru: Имитируемая высота выреза
zh_hans: 模拟的刘海高度

# AdvancedSetting.fallbackLCCType
source: Value to set LC_CTYPE to if the machine‘s combination of country and language are not supported. If unset, the encoding (e.g., UTF-8) will be used.
de: Wert, auf den LC_CTYPE gesetzt wird, wenn die Kombination aus Land und Sprache des Rechners nicht unterstützt wird. Wenn nicht gesetzt, wird die Kodierung (z. B. UTF-8) verwendet.
ja: マシンの国と言語の組み合わせがサポートされていない場合に LC_CTYPE に設定する値。 未設定の場合、エンコーディング (UTF-8 など) が使用されます。
pt_br: Valor para definir LC_CTYPE se a combinação de país e idioma da máquina não for suportada. Se não definido, a codificação (p. ex., UTF-8) será usada.
ru: Значение для LC_CTYPE, если сочетание страны и языка компьютера не поддерживается. Если не задано, будет использована кодировка (например, UTF-8).
zh_hans: 当机器的国家/地区与语言组合不受支持时，应设置的LC_CTYPE值。 如果未设置该值，则会使用默认编码（例如UTF-8）。

# AdvancedSetting.fastForegroundJobUpdates
source: Enable low-latency updates of the current foreground job
de: Aktualisierungen des aktuellen Vordergrundjobs mit geringer Latenz aktivieren
ja: 現在のフォアグラウンドジョブの低遅延更新を有効にします
pt_br: Ativar atualizações de baixa latência do processo em primeiro plano atual
ru: Включить обновления текущего активного процесса с низкой задержкой
zh_hans: 启用当前前台任务的低延迟更新功能

# AdvancedSetting.fastTrackpad
source: Trackpad scrolls fast? Set to No for legacy scrolling speed.
de: Trackpad scrollt schnell? Auf „Nein“ setzen für die alte Scrollgeschwindigkeit.
ja: トラックパッドを高速でスクロールしますか? 従来のスクロール速度にするには「いいえ」に設定してください。
pt_br: O trackpad rola rápido? Defina como Não para a velocidade de rolagem legada.
ru: Быстрая прокрутка трекпадом? Установите «Нет» для прежней скорости прокрутки.
zh_hans: 触控板滚动速度过快？ 如需恢复旧版滚动速度，请设置为“否”。

# AdvancedSetting.fastTriggerRegexes
source: Fast regular expression evaluation for triggers. This is experimental because it could potentially change how regular expressions are interpreted.
de: Schnelle Auswertung regulärer Ausdrücke für Trigger. Dies ist experimentell, da es die Interpretation regulärer Ausdrücke möglicherweise verändert.
ja: トリガー用の高速な正規表現評価。 正規表現の解釈方法が変わる可能性があるため、これは実験的な機能です。
pt_br: Avaliação rápida de expressões regulares para gatilhos. Isto é experimental porque poderia potencialmente alterar como as expressões regulares são interpretadas.
ru: Быстрое вычисление регулярных выражений для триггеров. Это экспериментальная функция, поскольку она потенциально может изменить интерпретацию регулярных выражений.
zh_hans: 用于触发器的快速正则表达式评估功能。 该功能仍处于测试阶段，因为可能会改变正则表达式的解析方式。
